Constant-height-defining lines must be parallel.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId ConstantHeightNotParallelError { get; }
  Visual Basic
Public Shared ReadOnly Property ConstantHeightNotParallelError As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ ConstantHeightNotParallelError {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace